Reports/Отчет_ЮрСлужба.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>Отчет_ЮрСлужба</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:TaskRef.Мероприятие</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабКод</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТипаМероприятия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДопРеквизитаМероприятия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Отчет_ЮрСлужба/Ext/ObjectModule.bsl
//Вызываемая процедура
Процедура ЗаполнитьТабличныйДокумент(ТабДок) Экспорт
	Мероприятие = Объект;
	ТабДокИсторияДО = ТабДок;
	ЗаполнитьТаблицуКодов();
	
	ТабДокИсторияДО.Очистить();

	Если Мероприятие <> Неопределено И Не Мероприятие.Пустая() Тогда		
		Если ТипЗнч(Мероприятие) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			СсылкаДО = Мероприятие;
		ИначеЕсли ТипЗнч(Мероприятие) = Тип("СправочникСсылка.ИсполнительныеДокументы") Тогда
			СсылкаДО = Мероприятие.Владелец;	
		ИначеЕсли ТипЗнч(Мероприятие.Объект) = Тип("СправочникСсылка.ДолговыеОбязательства") Тогда
			СсылкаДО = Мероприятие.Объект;
		ИначеЕсли ТипЗнч(Мероприятие.Объект) = Тип("СправочникСсылка.ИсполнительныеДокументы") И 
				ЗначениеЗаполнено(Мероприятие.Объект) Тогда
			СсылкаДО = Мероприятие.Объект.Владелец;
		Иначе
			Возврат;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(СсылкаДО) Тогда
			Возврат;
		КонецЕсли;
		
		Макет = ЭтотОбъект.ПолучитьМакет("ИсторияДО");
		//Заполнение шапки
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.Дата0 = ЗаписатьКолонку(0, СсылкаДО);
		Область.Параметры.Дата1 = ЗаписатьКолонку(1, СсылкаДО,, Истина);	
		Область.Параметры.Дата2 = ЗаписатьКолонку(2, СсылкаДО);
		Область.Параметры.Дата3 = ЗаписатьКолонку(3, СсылкаДО);
		Область.Параметры.Дата4 = ЗаписатьКолонку(4, СсылкаДО);
		Область.Параметры.Дата5 = ЗаписатьКолонку(5, СсылкаДО);
		Область.Параметры.Дата6 = ЗаписатьКолонку(6, СсылкаДО);
		ТабДокИсторияДО.Вывести(Область);
		
		//Запрос по ключевым датам БП-ов
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	БизнесПроцессы.Ссылка КАК БизнесПроцесс,
		                      |	БизнесПроцессы.Дата
		                      |ПОМЕСТИТЬ Таблица
		                      |ИЗ
		                      |	БизнесПроцесс.БизнесПроцессы КАК БизнесПроцессы
		                      |ГДЕ
		                      |	(БизнесПроцессы.Объект = &Объект
		                      |			ИЛИ БизнесПроцессы.Объект.Владелец = &Объект)
		                      |	И НЕ БизнесПроцессы.ПометкаУдаления
		                      |	И БизнесПроцессы.Стартован
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Таблица.БизнесПроцесс,
		                      |	ЕСТЬNULL(МИНИМУМ(Мероприятие.ФактическаяДата), Таблица.Дата) КАК ФактическаяДата
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
		                      |		ПО Таблица.БизнесПроцесс = Мероприятие.БизнесПроцесс
		                      |			И (НЕ Мероприятие.ПометкаУдаления)
		                      |			И (Мероприятие.Выполнена)
		                      |			И (Мероприятие.ФактическаяДата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Таблица.БизнесПроцесс,
		                      |	Таблица.Дата
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ФактическаяДата");
		Запрос.УстановитьПараметр("Объект", СсылкаДО);
		РезультатБП = Запрос.Выполнить().Выбрать();
		
		//Запрос по мероприятиям нулевого уровня
		Запрос.Текст = "ВЫБРАТЬ
		               |	Мероприятие.ФактическаяДата,
		               |	Мероприятие.Комментарий
		               |ИЗ
		               |	Задача.Мероприятие КАК Мероприятие
		               |ГДЕ
		               |	Мероприятие.Выполнена
		               |	И Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		               |	И НЕ Мероприятие.ПометкаУдаления
		               |	И (Мероприятие.Объект = &Объект
		               |			ИЛИ Мероприятие.Объект.Владелец = &Объект)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Мероприятие.ФактическаяДата";
		Результат = Запрос.Выполнить().Выбрать();
		Флаг = Результат.Следующий();
		ФлагРаскраски = 
				Мероприятие.ОбъектРодитель = "" И 
				Мероприятие.БизнесПроцесс.Пустая();
		Пока РезультатБП.Следующий() Цикл
			Комментарий = "";
			Номер = 1;
			Пока Флаг И Результат.ФактическаяДата <= РезультатБП.ФактическаяДата Цикл
				//Компонуем строку Комментарий
				Если Результат.Комментарий <> "" Тогда
					Комментарий = Комментарий + Формат(Номер, "ЧГ=") + ") " + Результат.Комментарий + "  ";
					Номер = Номер + 1;
				КонецЕсли;
			
				Флаг = Результат.Следующий();
			КонецЦикла;
			
			Если Комментарий <> "" Тогда
				Область = Макет.ПолучитьОбласть("Примечание");
				Область.Параметры.Примечания = Комментарий;
				Если ФлагРаскраски Тогда
					Область.ТекущаяОбласть.ЦветФона = Новый Цвет(244, 236, 197);
				КонецЕсли;
				ТабДокИсторияДО.Вывести(Область);
			КонецЕсли;
			
			ПостроитьДеревоКомментариев("", СсылкаДО, Макет, 
					РезультатБП.БизнесПроцесс.Схема, РезультатБП.БизнесПроцесс, 0, ТабДокИсторияДО);
		КонецЦикла;
		
		Комментарий = "";
		Номер = 1;
		Пока Флаг Цикл
			//Компонуем строку Комментарий
			Если Результат.Комментарий <> "" Тогда
				Комментарий = Комментарий + Формат(Номер, "ЧГ=") + ") " + Результат.Комментарий + "  ";
				Номер = Номер + 1;
			КонецЕсли;
		
			Флаг = Результат.Следующий();
		КонецЦикла;
			
		Если Комментарий <> "" Тогда
			Область = Макет.ПолучитьОбласть("Примечание");
			Область.Параметры.Примечания = Комментарий;
			Если ФлагРаскраски Тогда
				Область.ТекущаяОбласть.ЦветФона = Новый Цвет(244, 236, 197);
			КонецЕсли;
			ТабДокИсторияДО.Вывести(Область);
		КонецЕсли;
		
				
		Область = Макет.ПолучитьОбласть("Конец");
		ТабДокИсторияДО.Вывести(Область);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаписатьКолонку(НомерКолонки, ДО, ТолькоПервуюДату = Ложь, БезПовторовВПределахОбъектаРодителя = Ложь)
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ТабКод.КодТипаМероприятия,
		                      |	ТабКод.КодДопРеквизитаМероприятия,
		                      |	ТабКод.НомерКолонки,
		                      |	ТабКод.КодРезультата
		                      |ПОМЕСТИТЬ ТабКод
		                      |ИЗ
		                      |	&ТабКод КАК ТабКод
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВЫБОР
		                      |		КОГДА ТабКод.КодДопРеквизитаМероприятия = """"
		                      |			ТОГДА Мероприятие.ФактическаяДата
		                      |		ИНАЧЕ МероприятиеДополнительныеРеквизиты.Значение
		                      |	КОНЕЦ КАК ДатаМероприятия,
		                      |	Мероприятие.БизнесПроцесс КАК БизнесПроцесс,
		                      |	Мероприятие.Схема КАК Схема,
		                      |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель
		                      |ИЗ
		                      |	Задача.Мероприятие КАК Мероприятие
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Мероприятие.ДополнительныеРеквизиты КАК МероприятиеДополнительныеРеквизиты
		                      |		ПО (МероприятиеДополнительныеРеквизиты.Ссылка = Мероприятие.Ссылка)
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабКод КАК ТабКод
		                      |		ПО Мероприятие.ТипМероприятия.Код = ТабКод.КодТипаМероприятия
		                      |			И (ТабКод.КодДопРеквизитаМероприятия = """"
		                      |				ИЛИ МероприятиеДополнительныеРеквизиты.Свойство.Код = ТабКод.КодДопРеквизитаМероприятия)
		                      |			И (ТабКод.НомерКолонки = &НомерКолонки)
		                      |			И (Мероприятие.Результат.Код = ТабКод.КодРезультата
		                      |				ИЛИ ТабКод.КодРезультата = """")
		                      |ГДЕ
		                      |	(Мероприятие.Объект = &Объект
	                   		  |			ИЛИ Мероприятие.Объект.Владелец = &Объект)
		                      |	И Мероприятие.ФактическаяДата <= &ДатаОтчета
		                      |	И (НЕ Мероприятие.ПометкаУдаления)
		                      |	И Мероприятие.Выполнена
		                      |	И (Мероприятие.БизнесПроцесс = ЗНАЧЕНИЕ(БизнесПроцесс.БизнесПроцессы.ПустаяСсылка)
		                      |			ИЛИ (НЕ Мероприятие.БизнесПроцесс.ПометкаУдаления))
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ДатаМероприятия,
		                      |	БизнесПроцесс,
		                      |	Схема,
		                      |	ОбъектРодитель");	
	Запрос.УстановитьПараметр("НомерКолонки", НомерКолонки);	
    Запрос.УстановитьПараметр("ТабКод", ТабКод.Выгрузить());
	Запрос.УстановитьПараметр("Объект", ДО);
	Запрос.УстановитьПараметр("ДатаОтчета", КонецДня(ТекущаяДата()));
	Результат = Запрос.Выполнить().Выбрать();
	СтрокаТМП = "";
	
	ТекОбъектРодитель = Неопределено;
	ТекДатаМероприятия = Неопределено;
	ТекСхема = Неопределено;
	ТекБП = Неопределено;
	Пока Результат.Следующий() Цикл
		Если БезПовторовВПределахОбъектаРодителя И ТекОбъектРодитель = Результат.ОбъектРодитель И 
				ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия) И ТекСхема = Результат.Схема И ТекБП = Результат.БизнесПроцесс И
				Не Результат.БизнесПроцесс.Пустая() Тогда
			Продолжить;
		КонецЕсли;
				
		СтрДата = Формат(Результат.ДатаМероприятия, "ДЛФ=Д");
		СтрокаТМП = СтрокаТМП + СтрДата + Символы.ПС;
		Если ТолькоПервуюДату Тогда
			Прервать;
		КонецЕсли;
		
		ТекОбъектРодитель = Результат.ОбъектРодитель;
		ТекДатаМероприятия = НачалоДня(Результат.ДатаМероприятия);
		ТекСхема = Результат.Схема;
		ТекБП = Результат.БизнесПроцесс;
	КонецЦикла;
    Возврат СокрЛП(СтрокаТМП);	
КонецФункции

&НаСервере
Процедура ПостроитьДеревоКомментариев(Знач ОбъектРодитель, СсылкаДО, Макет, Знач Схема, БизнесПроцесс, Глубина, ТабДокИсторияДО)
	Мероприятие = Объект;
	
	ФлагРаскрытия = 
			БизнесПроцесс = Мероприятие.БизнесПроцесс И 
			ОбъектРодитель = Лев(Мероприятие.ОбъектРодитель, СтрДлина(ОбъектРодитель));
	
	Область = Макет.ПолучитьОбласть("Примечание");
	Область.Параметры.Примечания = Строка(Схема);
	Область.ТекущаяОбласть.Отступ = Глубина;
	Если ФлагРаскрытия Тогда
		Область.ТекущаяОбласть.ЦветФона = Новый Цвет(244, 236, 197);
	КонецЕсли;
	ТабДокИсторияДО.Вывести(Область);
		
	ТабДокИсторияДО.НачатьГруппуСтрок(, ФлагРаскрытия);
	Глубина = Глубина + 2;
	
	//Получаем список с датами вложенных БП
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МИНИМУМ(ВЫБОР
	                      |			КОГДА Мероприятие.Выполнена
	                      |					И Мероприятие.ФактическаяДата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |				ТОГДА Мероприятие.ФактическаяДата
	                      |			ИНАЧЕ Мероприятие.Дата
	                      |		КОНЕЦ) КАК ФактическаяДата,
	                      |	Мероприятие.ОбъектРодитель КАК ОбъектРодитель
	                      |ИЗ
	                      |	Задача.Мероприятие КАК Мероприятие
	                      |ГДЕ
	                      |	Мероприятие.ОбъектРодитель ПОДОБНО &ОбъектРодительПодобно
	                      |	И (Мероприятие.Объект = &Объект
	                      |			ИЛИ Мероприятие.Объект.Владелец = &Объект)
	                      |	И (НЕ Мероприятие.ПометкаУдаления)
	                      |	И Мероприятие.БизнесПроцесс = &БизнесПроцесс
	                      |	И Мероприятие.ОбъектРодитель <> &ОбъектРодитель
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Мероприятие.ОбъектРодитель
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОбъектРодитель");
	Запрос.УстановитьПараметр("ОбъектРодительПодобно", ОбъектРодитель + "%");
	Запрос.УстановитьПараметр("ОбъектРодитель", ОбъектРодитель);
	Запрос.УстановитьПараметр("Объект", СсылкаДО);
	Запрос.УстановитьПараметр("БизнесПроцесс", БизнесПроцесс);
	Запрос.УстановитьПараметр("Схема", Схема);
	
	ОбъектРодительДлина = СтрДлина(ОбъектРодитель) + 2;
	Результат = Запрос.Выполнить().Выбрать();
	ТекОбъектРодитель = Неопределено;
	ТекФактическаяДата = Дата(3000, 1, 1);
	Список = Новый СписокЗначений();
	Пока Результат.Следующий() Цикл		
		Стр = Сред(Результат.ОбъектРодитель, ОбъектРодительДлина);
		СтрПозиция = Найти(Стр, "_") - 1;
		Если СтрПозиция > 0 Тогда
			Стр = Лев(Стр, СтрПозиция);
		КонецЕсли;
		
		Если ТекОбъектРодитель = Неопределено Тогда	
			ТекОбъектРодитель = Стр;
			ТекФактическаяДата = Результат.ФактическаяДата;
		ИначеЕсли ТекОбъектРодитель <> Стр Тогда
			Список.Добавить(ТекФактическаяДата, ТекОбъектРодитель);
			ТекОбъектРодитель = Стр;
			ТекФактическаяДата = Результат.ФактическаяДата;
		Иначе
			ТекФактическаяДата = Мин(ТекФактическаяДата, Результат.ФактическаяДата);
		КонецЕсли;
	КонецЦикла;
	Если ТекОбъектРодитель <> Неопределено Тогда	
		Список.Добавить(ТекФактическаяДата, ТекОбъектРодитель);
	КонецЕсли;
	Список.СортироватьПоЗначению();
	//Список с датами готов!
	
	//Начинаем параллельно заполнять текущую группу ТД
	Запрос.Текст = "ВЫБРАТЬ
	               |	Мероприятие.ФактическаяДата,
	               |	Мероприятие.Комментарий
	               |ИЗ
	               |	Задача.Мероприятие КАК Мероприятие
	               |ГДЕ
	               |	(Мероприятие.Объект = &Объект
	               |			ИЛИ Мероприятие.Объект.Владелец = &Объект)
	               |	И Мероприятие.Выполнена
	               |	И (НЕ Мероприятие.ПометкаУдаления)
	               |	И Мероприятие.БизнесПроцесс = &БизнесПроцесс
	               |	И Мероприятие.ОбъектРодитель = &ОбъектРодитель
	               |	И Мероприятие.ФактическаяДата <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Мероприятие.ФактическаяДата";
	Результат = Запрос.Выполнить().Выбрать();
	Флаг = Результат.Следующий();
		
	ФлагРаскраски = 	
			ОбъектРодитель = Мероприятие.ОбъектРодитель И
			ФлагРаскрытия;
	Для Каждого Элемент Из Список Цикл
		Комментарий = "";
		Номер = 1;
		Пока Флаг И Результат.ФактическаяДата <= Элемент.Значение Цикл
			//компонуем строку КОММЕНТАРИЙ
			Если Результат.Комментарий <> "" Тогда
				Комментарий = Комментарий + Формат(Номер, "ЧГ=") + ") " + Результат.Комментарий + "  ";
				Номер = Номер + 1;
			КонецЕсли;
			
			Флаг = Результат.Следующий();
		КонецЦикла;
		
		Если Комментарий <> "" Тогда
			Область = Макет.ПолучитьОбласть("Примечание");
			Область.Параметры.Примечания = Комментарий;
			Область.ТекущаяОбласть.Отступ = Глубина;
			Если ФлагРаскраски Тогда
				Область.ТекущаяОбласть.ЦветФона = Новый Цвет(244, 236, 197);
			КонецЕсли;
			ТабДокИсторияДО.Вывести(Область);
		КонецЕсли;
		
		//Запускаем постройку внутренней группы ТД
		СтрПозиция = Найти(Элемент.Представление, "*") - 1;
		СхемаВложеннаяИмя = Лев(Элемент.Представление, СтрПозиция);
		Строки = Схема.Стадии.НайтиСтроки(Новый Структура("Идентификатор", СхемаВложеннаяИмя));
		Если Строки.Количество() > 0 Тогда
			ПостроитьДеревоКомментариев(ОбъектРодитель + "_" + Элемент.Представление, СсылкаДО, Макет, 
					Строки[0].Стадия, БизнесПроцесс, Глубина, ТабДокИсторияДО);
		КонецЕсли;
	КонецЦикла;
	
	Комментарий = "";
	Номер = 1;
	Пока Флаг Цикл
		//компонуем строку КОММЕНТАРИЙ
		Если Результат.Комментарий <> "" Тогда
			Комментарий = Комментарий + Формат(Номер, "ЧГ=") + ") " + Результат.Комментарий + "  ";
			Номер = Номер + 1;
		КонецЕсли;
		
		Флаг = Результат.Следующий();
	КонецЦикла;
	
	Если Комментарий <> "" Тогда
		Область = Макет.ПолучитьОбласть("Примечание");
		Область.Параметры.Примечания = Комментарий;
		Область.ТекущаяОбласть.Отступ = Глубина;
		Если ФлагРаскраски Тогда
			Область.ТекущаяОбласть.ЦветФона = Новый Цвет(244, 236, 197);
		КонецЕсли;
		ТабДокИсторияДО.Вывести(Область);
	КонецЕсли;	
		
	Глубина = Глубина - 2;
	ТабДокИсторияДО.ЗакончитьГруппуСтрок();
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьТаблицуКодов()
	ТабКод.Очистить();
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000018";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002033"; //"";
	НоваяСтрока.НомерКолонки = 0;
	НоваяСтрока.КодРезультата = "";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000019";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000023";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000055";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000126";
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000048";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000072";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000020";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000048";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000095";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000096";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000148";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000100";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000120";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000127";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000086";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002001";
	НоваяСтрока.НомерКолонки = 1;
	НоваяСтрока.КодРезультата = "000000179";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000088";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000050";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000141";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000142";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002020"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000143";
		
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000034";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000182";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000050";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002037"; //"";
	НоваяСтрока.НомерКолонки = 2;
	НоваяСтрока.КодРезультата = "000000180";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000069";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002031"; //"";
	НоваяСтрока.НомерКолонки = 3;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000070";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002017";
	НоваяСтрока.НомерКолонки = 4;
	НоваяСтрока.КодРезультата = "000000100";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000083";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002018";
	НоваяСтрока.НомерКолонки = 6;
	НоваяСтрока.КодРезультата = "000000114";
	
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000074";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002007";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000073";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002007";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000078";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002009";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
	
	НоваяСтрока = ТабКод.Добавить();
	НоваяСтрока.КодТипаМероприятия = "000000079";
	НоваяСтрока.КодДопРеквизитаМероприятия = "000002009";
	НоваяСтрока.НомерКолонки = 5;
	НоваяСтрока.КодРезультата = "";
КонецПроцедуры
